arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_ccfg.h
// Field:    [17] XOSC_CAP_MOD
//
// Enable modification (delta) to XOSC cap-array. Value specified in
// XOSC_CAPARRAY_DELTA.
// 0: Apply cap-array delta
// 1: Do not apply cap-array delta (default)
#define CCFG_MODE_CONF_XOSC_CAP_MOD                                 0x00020000
#define CCFG_MODE_CONF_XOSC_CAP_MOD_BITN                                    17
#define CCFG_MODE_CONF_XOSC_CAP_MOD_M                               0x00020000
#define CCFG_MODE_CONF_XOSC_CAP_MOD_S                                       17

// Field:    [16] HF_COMP
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_MODE_CONF_HF_COMP                                      0x00010000
#define CCFG_MODE_CONF_HF_COMP_BITN                                         16
#define CCFG_MODE_CONF_HF_COMP_M                                    0x00010000
#define CCFG_MODE_CONF_HF_COMP_S                                            16

// Field:  [15:8] XOSC_CAPARRAY_DELTA
//
// Signed 8-bit value, directly modifying trimmed XOSC cap-array step value.
// Enabled by XOSC_CAP_MOD.
#define CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_M                        0x0000FF00
#define CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_S                                 8

// Field:   [7:0] VDDR_CAP
//
// Unsigned 8-bit integer, representing the minimum decoupling capacitance
// (worst case) on VDDR, in units of 100nF. This should take into account
// capacitor tolerance and voltage dependent capacitance variation. This bit
// affects the recharge period calculation when going into powerdown or
// standby.
//
// NOTE! If using the following functions this field must be configured (used
// by TI RTOS):
// SysCtrlSetRechargeBeforePowerDown() SysCtrlAdjustRechargeAfterPowerDown()
#define CCFG_MODE_CONF_VDDR_CAP_M                                   0x000000FF
#define CCFG_MODE_CONF_VDDR_CAP_S                                            0

//*****************************************************************************
//
// Register: CCFG_O_VOLT_LOAD_0
//
//*****************************************************************************
// Field: [31:24] VDDR_EXT_TP45
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP45_M                            0xFF000000
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP45_S                                    24

// Field: [23:16] VDDR_EXT_TP25
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP25_M                            0x00FF0000
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP25_S                                    16

// Field:  [15:8] VDDR_EXT_TP5
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP5_M                             0x0000FF00
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP5_S                                      8

// Field:   [7:0] VDDR_EXT_TM15
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TM15_M                            0x000000FF
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TM15_S                                     0

//*****************************************************************************
//
// Register: CCFG_O_VOLT_LOAD_1
//
//*****************************************************************************
// Field: [31:24] VDDR_EXT_TP125
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP125_M                           0xFF000000
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP125_S                                   24

// Field: [23:16] VDDR_EXT_TP105
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP105_M                           0x00FF0000
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP105_S                                   16

// Field:  [15:8] VDDR_EXT_TP85
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP85_M                            0x0000FF00
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP85_S                                     8

// Field:   [7:0] VDDR_EXT_TP65
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP65_M                            0x000000FF
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP65_S                                     0

//*****************************************************************************
//
// Register: CCFG_O_RTC_OFFSET
//
//*****************************************************************************
// Field: [31:16] RTC_COMP_P0
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_RTC_OFFSET_RTC_COMP_P0_M                               0xFFFF0000
#define CCFG_RTC_OFFSET_RTC_COMP_P0_S                                       16

// Field:  [15:8] RTC_COMP_P1
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_RTC_OFFSET_RTC_COMP_P1_M                               0x0000FF00
#define CCFG_RTC_OFFSET_RTC_COMP_P1_S                                        8

// Field:   [7:0] RTC_COMP_P2
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_RTC_OFFSET_RTC_COMP_P2_M                               0x000000FF
#define CCFG_RTC_OFFSET_RTC_COMP_P2_S                                        0

//*****************************************************************************
//
// Register: CCFG_O_FREQ_OFFSET
//
//*****************************************************************************
// Field: [31:16] HF_COMP_P0
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_FREQ_OFFSET_HF_COMP_P0_M                               0xFFFF0000
#define CCFG_FREQ_OFFSET_HF_COMP_P0_S                                       16

// Field:  [15:8] HF_COMP_P1
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_FREQ_OFFSET_HF_COMP_P1_M                               0x0000FF00
#define CCFG_FREQ_OFFSET_HF_COMP_P1_S                                        8

// Field:   [7:0] HF_COMP_P2
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_FREQ_OFFSET_HF_COMP_P2_M                               0x000000FF
#define CCFG_FREQ_OFFSET_HF_COMP_P2_S                                        0

//*****************************************************************************
//
// Register: CCFG_O_IEEE_MAC_0
//
//*****************************************************************************
// Field:  [31:0] ADDR
//
// Bits[31:0] of the 64-bits custom IEEE MAC address.
// If different from 0xFFFFFFFF then the value of this field is applied;
// otherwise use value from FCFG.
#define CCFG_IEEE_MAC_0_ADDR_M                                      0xFFFFFFFF
#define CCFG_IEEE_MAC_0_ADDR_S                                               0

//*****************************************************************************
//
// Register: CCFG_O_IEEE_MAC_1
//
//*****************************************************************************
// Field:  [31:0] ADDR
//
// Bits[63:32] of the 64-bits custom IEEE MAC address.
// If different from 0xFFFFFFFF then the value of this field is applied;
// otherwise use value from FCFG.
#define CCFG_IEEE_MAC_1_ADDR_M                                      0xFFFFFFFF
#define CCFG_IEEE_MAC_1_ADDR_S                                               0

//*****************************************************************************
//
// Register: CCFG_O_IEEE_BLE_0
//
//*****************************************************************************
// Field:  [31:0] ADDR
//
// Bits[31:0] of the 64-bits custom IEEE BLE address.
// If different from 0xFFFFFFFF then the value of this field is applied;
// otherwise use value from FCFG.
#define CCFG_IEEE_BLE_0_ADDR_M                                      0xFFFFFFFF
#define CCFG_IEEE_BLE_0_ADDR_S                                               0

//*****************************************************************************
//
// Register: CCFG_O_IEEE_BLE_1
//
//*****************************************************************************
// Field:  [31:0] ADDR
//
// Bits[63:32] of the 64-bits custom IEEE BLE address.
// If different from 0xFFFFFFFF then the value of this field is applied;
// otherwise use value from FCFG.
#define CCFG_IEEE_BLE_1_ADDR_M                                      0xFFFFFFFF
#define CCFG_IEEE_BLE_1_ADDR_S                                               0

//*****************************************************************************
//
// Register: CCFG_O_BL_CONFIG
//
//*****************************************************************************
// Field: [31:24] BOOTLOADER_ENABLE
//
// Bootloader enable. Boot loader can be accessed if
// IMAGE_VALID_CONF.IMAGE_VALID is non-zero or BL_ENABLE is enabled (and
// conditions for failure analysis are met).
// 0xC5: Boot loader is enabled
// Any other value: Boot loader is disabled
#define CCFG_BL_CONFIG_BOOTLOADER_ENABLE_M                          0xFF000000
#define CCFG_BL_CONFIG_BOOTLOADER_ENABLE_S                                  24

