arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_ccfg.h
// Field:    [27] WRT_PROT_SEC_27
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_27                         0x08000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_27_BITN                            27
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_27_M                       0x08000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_27_S                               27

// Field:    [26] WRT_PROT_SEC_26
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_26                         0x04000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_26_BITN                            26
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_26_M                       0x04000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_26_S                               26

// Field:    [25] WRT_PROT_SEC_25
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_25                         0x02000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_25_BITN                            25
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_25_M                       0x02000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_25_S                               25

// Field:    [24] WRT_PROT_SEC_24
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_24                         0x01000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_24_BITN                            24
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_24_M                       0x01000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_24_S                               24

// Field:    [23] WRT_PROT_SEC_23
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_23                         0x00800000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_23_BITN                            23
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_23_M                       0x00800000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_23_S                               23

// Field:    [22] WRT_PROT_SEC_22
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_22                         0x00400000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_22_BITN                            22
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_22_M                       0x00400000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_22_S                               22

// Field:    [21] WRT_PROT_SEC_21
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_21                         0x00200000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_21_BITN                            21
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_21_M                       0x00200000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_21_S                               21

// Field:    [20] WRT_PROT_SEC_20
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_20                         0x00100000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_20_BITN                            20
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_20_M                       0x00100000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_20_S                               20

// Field:    [19] WRT_PROT_SEC_19
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_19                         0x00080000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_19_BITN                            19
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_19_M                       0x00080000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_19_S                               19

// Field:    [18] WRT_PROT_SEC_18
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_18                         0x00040000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_18_BITN                            18
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_18_M                       0x00040000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_18_S                               18

// Field:    [17] WRT_PROT_SEC_17
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_17                         0x00020000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_17_BITN                            17
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_17_M                       0x00020000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_17_S                               17

// Field:    [16] WRT_PROT_SEC_16
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_16                         0x00010000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_16_BITN                            16
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_16_M                       0x00010000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_16_S                               16

// Field:    [15] WRT_PROT_SEC_15
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_15                         0x00008000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_15_BITN                            15
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_15_M                       0x00008000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_15_S                               15

// Field:    [14] WRT_PROT_SEC_14
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_14                         0x00004000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_14_BITN                            14
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_14_M                       0x00004000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_14_S                               14

// Field:    [13] WRT_PROT_SEC_13
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_13                         0x00002000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_13_BITN                            13
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_13_M                       0x00002000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_13_S                               13

// Field:    [12] WRT_PROT_SEC_12
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_12                         0x00001000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_12_BITN                            12
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_12_M                       0x00001000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_12_S                               12

// Field:    [11] WRT_PROT_SEC_11
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_11                         0x00000800
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_11_BITN                            11
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_11_M                       0x00000800
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_11_S                               11

// Field:    [10] WRT_PROT_SEC_10
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_10                         0x00000400
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_10_BITN                            10
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_10_M                       0x00000400
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_10_S                               10

